Schlatter076/EMB-BL-ccm-xx-C/Libs/tsPeriph/FF_3rdPty/NRF51_52fwlib/components/ble/ble_services/ble_ancs_c/nrf_ble_ancs_c.c
    nrf_ble_gq_req_t ancs_req;
    uint8_t          gattc_value[BLE_ANCS_WRITE_MAX_MSG_LENGTH];

    memset(&ancs_req, 0, sizeof(nrf_ble_gq_req_t));

    uint16_t len = encode_notif_action(gattc_value, uid, action_id);

    ancs_req.type                        = NRF_BLE_GQ_REQ_GATTC_WRITE;
    ancs_req.error_handler.cb            = p_ancs->gatt_err_handler;
    ancs_req.error_handler.p_ctx         = p_ancs;
    ancs_req.params.gattc_write.handle   = p_ancs->service.control_point_char.handle_value;
    ancs_req.params.gattc_write.p_value  = gattc_value;
    ancs_req.params.gattc_write.offset   = 0;
    ancs_req.params.gattc_write.write_op = BLE_GATT_OP_WRITE_REQ;
    ancs_req.params.gattc_write.len      = len;

    return nrf_ble_gq_item_add(p_ancs->p_gatt_queue, &ancs_req, p_ancs->conn_handle);
}

ret_code_t nrf_ble_ancs_c_handles_assign(ble_ancs_c_t * p_ancs,
                                         uint16_t const conn_handle,
                                         ble_ancs_c_service_t const * p_peer_handles)
{
    VERIFY_PARAM_NOT_NULL(p_ancs);

    p_ancs->conn_handle = conn_handle;

    if (p_peer_handles != NULL)
    {
        p_ancs->service.control_point_char.handle_value = p_peer_handles->control_point_char.handle_value;
        p_ancs->service.data_source_cccd.handle         = p_peer_handles->data_source_cccd.handle;
        p_ancs->service.data_source_char.handle_value   = p_peer_handles->data_source_char.handle_value;
        p_ancs->service.notif_source_cccd.handle        = p_peer_handles->notif_source_cccd.handle;
        p_ancs->service.notif_source_char.handle_value  = p_peer_handles->notif_source_char.handle_value;
    }

    return nrf_ble_gq_conn_handle_register(p_ancs->p_gatt_queue, conn_handle);
}

#endif// NRF_MODULE_ENABLED(BLE_ANCS_C)
